/**
 * 利率数据，来自之前PC站的代码，没文档，不清楚逻辑规则，没敢动
 * @ fenglinzeng@fang.com
 * @ 2017.09.04
 */
let lilvArr = [];
// 12年6月8日基准利率
lilvArr[1] = [];
lilvArr[1][1] = [];
lilvArr[1][2] = [];
lilvArr[1][1][1] = 0.0631; // 商贷1年 6.31%
lilvArr[1][1][3] = 0.064; // 商贷1～3年 6.4%
lilvArr[1][1][5] = 0.0665; // 商贷 3～5年 6.65%
lilvArr[1][1][10] = 0.068; // 商贷 5-30年 6.8%
lilvArr[1][2][5] = 0.042; // 公积金 1～5年 4.2%
lilvArr[1][2][10] = 0.047; // 公积金 5-30年 4.7%
// 12年6月8日利率下限（7折）
lilvArr[2] = [];
lilvArr[2][1] = [];
lilvArr[2][2] = [];
lilvArr[2][1][1] = 0.04417; // 商贷1年 4.417%
lilvArr[2][1][3] = 0.0448; // 商贷1～3年 4.48%
lilvArr[2][1][5] = 0.04655; // 商贷 3～5年 4.655%
lilvArr[2][1][10] = 0.0476; // 商贷 5-30年 4.76%
lilvArr[2][2][5] = 0.042; // 公积金 1～5年 4.2%
lilvArr[2][2][10] = 0.047; // 公积金 5-30年 4.7%
// 12年6月8日利率下限（85折）
lilvArr[3] = [];
lilvArr[3][1] = [];
lilvArr[3][2] = [];
lilvArr[3][1][1] = 0.053635; // 商贷1年 5.3635%
lilvArr[3][1][3] = 0.0544; // 商贷1～3年 5.44%
lilvArr[3][1][5] = 0.056525; // 商贷 3～5年 5.6525%
lilvArr[3][1][10] = 0.0578; // 商贷 5-30年 5.78%
lilvArr[3][2][5] = 0.042; // 公积金 1～5年 4.2%
lilvArr[3][2][10] = 0.047; // 公积金 5-30年 4.7%
// 12年6月8日利率上限（1.1倍）
lilvArr[4] = [];
lilvArr[4][1] = [];
lilvArr[4][2] = [];
lilvArr[4][1][1] = 0.06941; // 商贷1年 6.941%
lilvArr[4][1][3] = 0.0704; // 商贷1～3年 7.04%
lilvArr[4][1][5] = 0.07315; // 商贷 3～5年 7.315%
lilvArr[4][1][10] = 0.0748; // 商贷 5-30年 7.48%
lilvArr[4][2][5] = 0.042; // 公积金 1～5年 4.2%
lilvArr[4][2][10] = 0.047; // 公积金 5-30年 4.7%
// 12年7月6日基准利率
lilvArr[5] = [];
lilvArr[5][1] = [];
lilvArr[5][2] = [];
lilvArr[5][1][1] = 0.06; // 商贷1年 6%
lilvArr[5][1][3] = 0.0615; // 商贷1～3年 6.15%
lilvArr[5][1][5] = 0.064; // 商贷 3～5年 6.4%
lilvArr[5][1][10] = 0.0655; // 商贷 5-30年 6.55%
lilvArr[5][2][5] = 0.04; // 公积金 1～5年 4%
lilvArr[5][2][10] = 0.045; // 公积金 5-30年 4.5%
// 12年7月6日利率下限（7折）
lilvArr[6] = [];
lilvArr[6][1] = [];
lilvArr[6][2] = [];
lilvArr[6][1][1] = 0.042; // 商贷1年 4.2%
lilvArr[6][1][3] = 0.04305; // 商贷1～3年 4.305%
lilvArr[6][1][5] = 0.0448; // 商贷 3～5年 4.48%
lilvArr[6][1][10] = 0.04585; // 商贷 5-30年 4.585%
lilvArr[6][2][5] = 0.04; // 公积金 1～5年 4%
lilvArr[6][2][10] = 0.045; // 公积金 5-30年 4.5%
// 12年7月6日利率下限（85折）
lilvArr[7] = [];
lilvArr[7][1] = [];
lilvArr[7][2] = [];
lilvArr[7][1][1] = 0.051; // 商贷1年 5.1%
lilvArr[7][1][3] = 0.052275; // 商贷1～3年 5.2275%
lilvArr[7][1][5] = 0.0544; // 商贷 3～5年 5.44%
lilvArr[7][1][10] = 0.055675; // 商贷 5-30年 5.5675%
lilvArr[7][2][5] = 0.04; // 公积金 1～5年 4%
lilvArr[7][2][10] = 0.045; // 公积金 5-30年 4.5%
// 12年7月6日利率上限（1.1倍）
lilvArr[8] = [];
lilvArr[8][1] = [];
lilvArr[8][2] = [];
lilvArr[8][1][1] = 0.066; // 商贷1年 6.6%
lilvArr[8][1][3] = 0.06765; // 商贷1～3年 6.765%
lilvArr[8][1][5] = 0.0704; // 商贷 3～5年 7.04%
lilvArr[8][1][10] = 0.07205; // 商贷 5-30年 7.205%
lilvArr[8][2][5] = 0.04; // 公积金 1～5年 4%
lilvArr[8][2][10] = 0.045; // 公积金 5-30年 4.5%
// 20141124宋文渊新增贷款利率
// 14年11月22日基准利率
lilvArr[9] = [];
lilvArr[9][1] = [];
lilvArr[9][2] = [];
lilvArr[9][1][1] = 0.06; // 商贷1年 6%
lilvArr[9][1][3] = 0.06; // 商贷1～3年 6%
lilvArr[9][1][5] = 0.06; // 商贷 3～5年 6%
lilvArr[9][1][10] = 0.0615; // 商贷 5-30年 6.15%
lilvArr[9][2][5] = 0.0375; // 公积金 1～5年 4%
lilvArr[9][2][10] = 0.0425; // 公积金 5-30年 4.5%
// 14年11月22日利率下限（7折）
lilvArr[10] = [];
lilvArr[10][1] = [];
lilvArr[10][2] = [];
lilvArr[10][1][1] = 0.042; // 商贷1年 6%
lilvArr[10][1][3] = 0.042; // 商贷1～3年 6%
lilvArr[10][1][5] = 0.042; // 商贷 3～5年 6%
lilvArr[10][1][10] = 0.04305; // 商贷 5-30年 6.15%
lilvArr[10][2][5] = 0.02625; // 公积金 1～5年 4%
lilvArr[10][2][10] = 0.02975; // 公积金 5-30年 4.5%
// 14年11月22日利率下限（85折）
lilvArr[11] = [];
lilvArr[11][1] = [];
lilvArr[11][2] = [];
lilvArr[11][1][1] = 0.051; // 商贷1年 5.1%
lilvArr[11][1][3] = 0.051; // 商贷1～3年 5.2275%
lilvArr[11][1][5] = 0.051; // 商贷 3～5年 5.44%
lilvArr[11][1][10] = 0.052275; // 商贷 5-30年 5.5675%
lilvArr[11][2][5] = 0.031875; // 公积金 1～5年 4%
lilvArr[11][2][10] = 0.036125; // 公积金 5-30年 4.5%
// 14年11月22日利率上限（1.1倍）
lilvArr[12] = [];
lilvArr[12][1] = [];
lilvArr[12][2] = [];
lilvArr[12][1][1] = 0.066; // 商贷1年 6.6%
lilvArr[12][1][3] = 0.066; // 商贷1～3年 6.765%
lilvArr[12][1][5] = 0.066; // 商贷 3～5年 7.04%
lilvArr[12][1][10] = 0.06765; // 商贷 5-30年 7.205%
lilvArr[12][2][5] = 0.04125; // 公积金 1～5年 4%
lilvArr[12][2][10] = 0.04675; // 公积金 5-30年 4.5%

// 2015年2月28日杨普法新增贷款利率
// 2015年3月1日基准利率
lilvArr[13] = [];
lilvArr[13][1] = [];
lilvArr[13][2] = [];
lilvArr[13][1][1] = 0.0535; // 商贷1年 6%
lilvArr[13][1][3] = 0.0575; // 商贷1～3年 6%
lilvArr[13][1][5] = 0.0575; // 商贷 3～5年 6%
lilvArr[13][1][10] = 0.059; // 商贷 5-30年 6.15%
lilvArr[13][2][5] = 0.035; // 公积金 1～5年 4%
lilvArr[13][2][10] = 0.04; // 公积金 5-30年 4.5%
// /2015年3月1日利率下限（7折）
lilvArr[14] = [];
lilvArr[14][1] = [];
lilvArr[14][2] = [];
lilvArr[14][1][1] = 0.03745; // 商贷1年 6%
lilvArr[14][1][3] = 0.04025; // 商贷1～3年 6%
lilvArr[14][1][5] = 0.04025; // 商贷 3～5年 6%
lilvArr[14][1][10] = 0.0413; // 商贷 5-30年 6.15%
lilvArr[14][2][5] = 0.0245; // 公积金 1～5年 4%
lilvArr[14][2][10] = 0.028; // 公积金 5-30年 4.5%
// /2015年3月1日利率下限（85折）
lilvArr[15] = [];
lilvArr[15][1] = [];
lilvArr[15][2] = [];
lilvArr[15][1][1] = 0.045475; // 商贷1年 5.1%
lilvArr[15][1][3] = 0.048875; // 商贷1～3年 5.2275%
lilvArr[15][1][5] = 0.048875; // 商贷 3～5年 5.44%
lilvArr[15][1][10] = 0.05015; // 商贷 5-30年 5.5675%
lilvArr[15][2][5] = 0.02975; // 公积金 1～5年 4%
lilvArr[15][2][10] = 0.034; // 公积金 5-30年 4.5%
// /2015年3月1日利率上限（1.1倍）
lilvArr[16] = [];
lilvArr[16][1] = [];
lilvArr[16][2] = [];
lilvArr[16][1][1] = 0.05885; // 商贷1年 6.6%
lilvArr[16][1][3] = 0.06325; // 商贷1～3年 6.765%
lilvArr[16][1][5] = 0.06325; // 商贷 3～5年 7.04%
lilvArr[16][1][10] = 0.0649; // 商贷 5-30年 7.205%
lilvArr[16][2][5] = 0.0385; // 公积金 1～5年 4%
lilvArr[16][2][10] = 0.044; // 公积金 5-30年 4.5%
// 2015年5月11日张延科新增贷款利率!
// 2015年5月11日基准利率
lilvArr[17] = [];
lilvArr[17][1] = [];
lilvArr[17][2] = [];
lilvArr[17][1][1] = 0.051; // 商贷1年 6%
lilvArr[17][1][3] = 0.055; // 商贷1～3年 6%
lilvArr[17][1][5] = 0.055; // 商贷 3～5年 6%
lilvArr[17][1][10] = 0.0565; // 商贷 5-30年 6.15%
lilvArr[17][2][5] = 0.0325; // 公积金 1～5年 4%
lilvArr[17][2][10] = 0.0375; // 公积金 5-30年 4.5%
// 2015年5月11日利率下限（7折）
lilvArr[18] = [];
lilvArr[18][1] = [];
lilvArr[18][2] = [];
lilvArr[18][1][1] = 0.0357; // 商贷1年 6%
lilvArr[18][1][3] = 0.0385; // 商贷1～3年 6%
lilvArr[18][1][5] = 0.0385; // 商贷 3～5年 6%
lilvArr[18][1][10] = 0.03955; // 商贷 5-30年 6.15%
lilvArr[18][2][5] = 0.02275; // 公积金 1～5年 4%
lilvArr[18][2][10] = 0.02625; // 公积金 5-30年 4.5%
// 2015年5月11日利率下限（85折）
lilvArr[19] = [];
lilvArr[19][1] = [];
lilvArr[19][2] = [];
lilvArr[19][1][1] = 0.04335; // 商贷1年 5.1%
lilvArr[19][1][3] = 0.04675; // 商贷1～3年 5.2275%
lilvArr[19][1][5] = 0.04675; // 商贷 3～5年 5.44%
lilvArr[19][1][10] = 0.048025; // 商贷 5-30年 5.5675%
lilvArr[19][2][5] = 0.027625; // 公积金 1～5年 4%
lilvArr[19][2][10] = 0.031875; // 公积金 5-30年 4.5%
// 2015年5月11日利率上限（1.1倍）
lilvArr[20] = [];
lilvArr[20][1] = [];
lilvArr[20][2] = [];
lilvArr[20][1][1] = 0.0561; // 商贷1年 6.6%
lilvArr[20][1][3] = 0.0605; // 商贷1～3年 6.765%
lilvArr[20][1][5] = 0.0605; // 商贷 3～5年 7.04%
lilvArr[20][1][10] = 0.06215; // 商贷 5-30年 7.205%
lilvArr[20][2][5] = 0.03575; // 公积金 1～5年 4%
lilvArr[20][2][10] = 0.04125; // 公积金 5-30年 4.5%
// 2015年6月28日zhyk新增贷款利率!
// 2015年6月28日基准利率
lilvArr[21] = [];
lilvArr[21][1] = [];
lilvArr[21][2] = [];
lilvArr[21][1][1] = 0.0485; // 商贷1年 6%
lilvArr[21][1][3] = 0.0525; // 商贷1～3年 6%
lilvArr[21][1][5] = 0.0525; // 商贷 3～5年 6%
lilvArr[21][1][10] = 0.054; // 商贷 5-30年 6.15%
lilvArr[21][2][5] = 0.03; // 公积金 1～5年 4%
lilvArr[21][2][10] = 0.035; // 公积金 5-30年 4.5%
// 2015年6月28日利率下限（7折）
lilvArr[22] = [];
lilvArr[22][1] = [];
lilvArr[22][2] = [];
lilvArr[22][1][1] = 0.03395; // 商贷1年 6%
lilvArr[22][1][3] = 0.03675; // 商贷1～3年 6%
lilvArr[22][1][5] = 0.03675; // 商贷 3～5年 6%
lilvArr[22][1][10] = 0.0378; // 商贷 5-30年 6.15%
lilvArr[22][2][5] = 0.021; // 公积金 1～5年 4%
lilvArr[22][2][10] = 0.0245; // 公积金 5-30年 4.5%
// 2015年6月28日利率下限（85折）
lilvArr[23] = [];
lilvArr[23][1] = [];
lilvArr[23][2] = [];
lilvArr[23][1][1] = 0.041225; // 商贷1年 5.1%
lilvArr[23][1][3] = 0.044625; // 商贷1～3年 5.2275%
lilvArr[23][1][5] = 0.044625; // 商贷 3～5年 5.44%
lilvArr[23][1][10] = 0.0459; // 商贷 5-30年 5.5675%
lilvArr[23][2][5] = 0.0255; // 公积金 1～5年 4%
lilvArr[23][2][10] = 0.02975; // 公积金 5-30年 4.5%
// 2015年6月28日利率上限（1.1倍）
lilvArr[24] = [];
lilvArr[24][1] = [];
lilvArr[24][2] = [];
lilvArr[24][1][1] = 0.05335; // 商贷1年 6.6%
lilvArr[24][1][3] = 0.05775; // 商贷1～3年 6.765%
lilvArr[24][1][5] = 0.05775; // 商贷 3～5年 7.04%
lilvArr[24][1][10] = 0.0594; // 商贷 5-30年 7.205%
lilvArr[24][2][5] = 0.033; // 公积金 1～5年 4%
lilvArr[24][2][10] = 0.0385; // 公积金 5-30年 4.5%
// 15年8月26日基准利率
lilvArr[25] = [];
lilvArr[25][1] = [];
lilvArr[25][2] = [];
lilvArr[25][1][1] = 0.046; // 商贷1年 0.046
lilvArr[25][1][3] = 0.05; // 商贷1～3年 0.05
lilvArr[25][1][5] = 0.05; // 商贷 3～5年 0.05
lilvArr[25][1][10] = 0.0515; // 商贷 5-30年 0.0515
lilvArr[25][2][5] = 0.0275; // 公积金 1～5年 0.0275
lilvArr[25][2][10] = 0.0325; // 公积金 5-30年 0.0325
// 15年8月26日利率下限（7折）
lilvArr[26] = [];
lilvArr[26][1] = [];
lilvArr[26][2] = [];
lilvArr[26][1][1] = 0.0322; // 商贷1年 0.0322
lilvArr[26][1][3] = 0.035; // 商贷1～3年 0.035
lilvArr[26][1][5] = 0.035; // 商贷 3～5年 0.035
lilvArr[26][1][10] = 0.03605; // 商贷 5-30年 0.03605
lilvArr[26][2][5] = 0.01925; // 公积金 1～5年 0.01925
lilvArr[26][2][10] = 0.02275; // 公积金 5-30年 0.02275
// 15年8月26日利率下限（85折）
lilvArr[27] = [];
lilvArr[27][1] = [];
lilvArr[27][2] = [];
lilvArr[27][1][1] = 0.0391; // 商贷1年 0.0391
lilvArr[27][1][3] = 0.0425; // 商贷1～3年 0.0425
lilvArr[27][1][5] = 0.0425; // 商贷 3～5年 0.0425
lilvArr[27][1][10] = 0.043775; // 商贷 5-30年 0.043775
lilvArr[27][2][5] = 0.023375; // 公积金 1～5年 0.023375
lilvArr[27][2][10] = 0.027625; // 公积金 5-30年 0.027625
// 15年8月26日利率上限（1.1倍）
lilvArr[28] = [];
lilvArr[28][1] = [];
lilvArr[28][2] = [];
lilvArr[28][1][1] = 0.0506; // 商贷1年 0.0506
lilvArr[28][1][3] = 0.055; // 商贷1～3年 0.055
lilvArr[28][1][5] = 0.055; // 商贷 3～5年 0.055
lilvArr[28][1][10] = 0.05665; // 商贷 5-30年 0.05665
lilvArr[28][2][5] = 0.03025; // 公积金 1～5年 0.03025
lilvArr[28][2][10] = 0.03575; // 公积金 5-30年 0.03575
// 15年10月24日基准利率
lilvArr[29] = [];
lilvArr[29][1] = [];
lilvArr[29][2] = [];
lilvArr[29][1][1] = 0.0435; // 商贷1年 0.0435
lilvArr[29][1][3] = 0.0475; // 商贷1～3年 0.0475
lilvArr[29][1][5] = 0.0475; // 商贷 3～5年 0.0475
lilvArr[29][1][10] = 0.049; // 商贷 5-30年 0.049
lilvArr[29][2][5] = 0.0275; // 公积金 1～5年 0.0275
lilvArr[29][2][10] = 0.0325; // 公积金 5-30年 0.0325
// 15年10月24日利率下限（7折）
lilvArr[30] = [];
lilvArr[30][1] = [];
lilvArr[30][2] = [];
lilvArr[30][1][1] = 0.03045; // 商贷1年 0.03045
lilvArr[30][1][3] = 0.03325; // 商贷1～3年 0.03325
lilvArr[30][1][5] = 0.03325; // 商贷 3～5年 0.03325
lilvArr[30][1][10] = 0.0343; // 商贷 5-30年 0.0343
lilvArr[30][2][5] = 0.01925; // 公积金 1～5年 0.01925
lilvArr[30][2][10] = 0.02275; // 公积金 5-30年 0.02275
// 15年10月24日利率下限（85折）
lilvArr[31] = [];
lilvArr[31][1] = [];
lilvArr[31][2] = [];
lilvArr[31][1][1] = 0.036975; // 商贷1年 0.036975
lilvArr[31][1][3] = 0.040375; // 商贷1～3年 0.040375
lilvArr[31][1][5] = 0.040375; // 商贷 3～5年 0.040375
lilvArr[31][1][10] = 0.04165; // 商贷 5-30年 0.04165
lilvArr[31][2][5] = 0.023375; // 公积金 1～5年 0.023375
lilvArr[31][2][10] = 0.027625; // 公积金 5-30年 0.027625
// 15年10月24日利率下限（88折）
lilvArr[32] = [];
lilvArr[32][1] = [];
lilvArr[32][2] = [];
lilvArr[32][1][1] = 0.03828; // 商贷1年 0.03828
lilvArr[32][1][3] = 0.0418; // 商贷1～3年 0.0418
lilvArr[32][1][5] = 0.0418; // 商贷 3～5年 0.0418
lilvArr[32][1][10] = 0.04312; // 商贷 5-30年 0.04312
lilvArr[32][2][5] = 0.0242; // 公积金 1～5年 0.0242
lilvArr[32][2][10] = 0.0286; // 公积金 5-30年 0.0286
// 15年10月24日利率下限（9折）
lilvArr[33] = [];
lilvArr[33][1] = [];
lilvArr[33][2] = [];
lilvArr[33][1][1] = 0.03915; // 商贷1年 0.03915
lilvArr[33][1][3] = 0.04275; // 商贷1～3年 0.04275
lilvArr[33][1][5] = 0.04275; // 商贷 3～5年 0.04275
lilvArr[33][1][10] = 0.0441; // 商贷 5-30年 0.0441
lilvArr[33][2][5] = 0.02475; // 公积金 1～5年 0.02475
lilvArr[33][2][10] = 0.02925; // 公积金 5-30年 0.02925
// 15年10月24日利率下限（95折）
lilvArr[34] = [];
lilvArr[34][1] = [];
lilvArr[34][2] = [];
lilvArr[34][1][1] = 0.041325; // 商贷1年 0.041325
lilvArr[34][1][3] = 0.045125; // 商贷1～3年 0.045125
lilvArr[34][1][5] = 0.045125; // 商贷 3～5年 0.045125
lilvArr[34][1][10] = 0.04655; // 商贷 5-30年 0.04655
lilvArr[34][2][5] = 0.026125; // 公积金 1～5年 0.026125
lilvArr[34][2][10] = 0.030875; // 公积金 5-30年 0.030875
// 15年10月24日利率上限（1.1倍）
lilvArr[35] = [];
lilvArr[35][1] = [];
lilvArr[35][2] = [];
lilvArr[35][1][1] = 0.04785; // 商贷1年 0.04785
lilvArr[35][1][3] = 0.05225; // 商贷1～3年 0.05225
lilvArr[35][1][5] = 0.05225; // 商贷 3～5年 0.05225
lilvArr[35][1][10] = 0.0539; // 商贷 5-30年 0.0539
lilvArr[35][2][5] = 0.03025; // 公积金 1～5年 0.03025
lilvArr[35][2][10] = 0.03575; // 公积金 5-30年 0.03575
// 15年10月24日利率上限（1.2倍）
lilvArr[36] = [];
lilvArr[36][1] = [];
lilvArr[36][2] = [];
lilvArr[36][1][1] = 0.0522; // 商贷1年 0.0522
lilvArr[36][1][3] = 0.057; // 商贷1～3年 0.057
lilvArr[36][1][5] = 0.057; // 商贷 3～5年 0.057
lilvArr[36][1][10] = 0.0588; // 商贷 5-30年 0.0588
lilvArr[36][2][5] = 0.033; // 公积金 1～5年 0.033
lilvArr[36][2][10] = 0.039; // 公积金 5-30年 0.039
// 15年10月24日利率上限（1.3倍）
lilvArr[37] = [];
lilvArr[37][1] = [];
lilvArr[37][2] = [];
lilvArr[37][1][1] = 0.05655; // 商贷1年 0.05655
lilvArr[37][1][3] = 0.06175; // 商贷1～3年 0.06175
lilvArr[37][1][5] = 0.06175; // 商贷 3～5年 0.06175
lilvArr[37][1][10] = 0.0637; // 商贷 5-30年 0.0637
lilvArr[37][2][5] = 0.03575; // 公积金 1～5年 0.03575
lilvArr[37][2][10] = 0.04225; // 公积金 5-30年 0.04225

module.exports = lilvArr;